БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/СписаниеБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБонусов</name>
  <registerRecords>AccumulationRegister.НакопленияПоСкидкам</registerRecords>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСгорания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРаботыСБонусами</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/НакопленияПоСкидкам/НакопленияПоСкидкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НакопленияПоСкидкам</name>
  <resources>
    <name>Накопление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>CatalogRef.ВидыКартСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийРаботыСБонусами/ВидыОперацийРаботыСБонусами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРаботыСБонусами</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/СписаниеБонусов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движение = Движения.НакопленияПоСкидкам.Добавить();
	Если ВидОперации = Перечисления.ВидыОперацийРаботыСБонусами.Начисление Тогда	
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Иначе
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период = Дата;
	Движение.Получатель	 = Получатель;
	Движение.ВидСкидки	 = ВидСкидки;
	Движение.Накопление	 = СуммаСписания;
	Движения.Записать();
	
	Если Не СозданАвтоматически Тогда
		ДатаСгорания = Дата;
		РаботаСоСкидками.КонтрольОтрицательныхОстатков(Отказ, Получатель, ВидСкидки, "ПроверкаCписания");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РаботаСоСкидками.КонтрольОтрицательныхОстатков(Отказ, Получатель, ВидСкидки, "ПроверкаОтменыПроведения");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Получатель", Получатель);
	КонецЕсли;                              
КонецПроцедуры

#КонецОбласти
